app/controllers/admin_controller.rb

SELECT * FROM `products`
---
  def list
    @products = Product.all

INSERT INTO `products` (`image_url`, `updated_at`, `title`, `price`, `description`, `created_at`) VALUES('.jpg', '2010-05-11 19:27:16', 'lk', 10.0, 'lkj', '2010-05-11 19:27:16')
---
  def create
      @product = Product.new(params[:product])
      if @product.save

SELECT * FROM `products` WHERE (`products`.`id` = 9)
UPDATE `products` SET `price` = 20.0, `updated_at` = '2010-05-11 19:51:25' WHERE `id` = 9
---
  def update
    @product = Product.find(params[:id])
    if @product.update_attributes(params[:product])

DELETE FROM `products` WHERE `id` = 11
SELECT * FROM `products` WHERE (`products`.`id` = 11)
---
  def destroy
    Product.find(params[:id]).destroy