app/controllers/login_controller.rb

SELECT count(*) AS count_all FROM `orders`
---
  def index
    @total_orders = Order.count

SELECT * FROM `users` WHERE (`users`.`id` IS NULL) LIMIT 1
---
  def list_users
    @all_users = User.find(:all)

INSERT INTO `users` (`name`, `salt`, `hashed_password`) VALUES('Bradley', '138431800.231037428084449', '49ed4e1dcf084293981659ef2b375d98740c288e')
---
  def add_user
    @user = User.new(params[:user])
    if request.post? and @user.save

SELECT * FROM `users` WHERE (`users`.`id` = 1) LIMIT 1
DELETE FROM `users` WHERE `id` = 1
---
  def delete_user
    id = params[:id]
    if id && user = User.find(id)
      begin
        user.destroy