app/controllers/products_controller.rb

  def update
    @product = Product.find(params[:id])

    respond_to do |format|
      if @product.update_attributes(params[:product])
---
SELECT * FROM `products` WHERE (`products`.`id` = 1)
UPDATE `products` SET `title` = 'Bob', `description` = 'Can you build it?', `updated_at` = '2010-04-19 19:25:54', `image_url` = 'http://ttglibrary.files.wordpress.com/2009/06/bob-the-builder1.jpg' WHERE `id` = 4

  def destroy
    @product = Product.find(params[:id])
    @product.destroy
---
SELECT * FROM `products` WHERE (`products`.`id` = 2)
DELETE FROM `products` WHERE `id` = 2