app/controllers/store_controller.rb

  def add_to_cart
    begin
      product = Product.find(params[:id])
---
SELECT * FROM `products` WHERE (`products`.`id` = 4)

  def save_order
    @cart = find_cart
    @order = Order.new(params[:order])
    @order.add_line_items_from_cart(@cart)
    if @order.save
---
INSERT INTO `line_items` (`order_id`, `total_price`, `product_id`, `quantity`) VALUES(1, 500.0, 4, 1)
INSERT INTO `orders` (`name`, `pay_type`, `address`, `email`) VALUES('Bradley Bebchuk', 'cc', '3185 Olive Lane North Plymouth MN 55447', 'wildman28@comcast.net')